In [2]:
import pandas as pd

In [3]:
df_address= pd.read_csv( "data/address/address.csv", sep=";")
df_products= pd.read_csv( "data/products/products.csv", sep=";")
df_sales= pd.read_csv( "data/sales/sales.csv", sep=";")
df_salesdetails= pd.read_csv( "data/sales_details/sales_details.csv", sep=";")
df_users= pd.read_csv( "data/users/users.csv", sep=";")

In [16]:
df_users.isna().sum()
df_users = df_users.dropna(subset=["id_cliente"]).copy()
df_users["nombre_completo"] = df_users["nombre_completo"].fillna("Desconocido")
df_users["email"] = df_users["email"].fillna("Desconocido")
df_users["telefono"] = df_users["telefono"].fillna("Desconocido")
df_users["username"] = df_users["username"].fillna("Desconocido")
df_users["numero_documento"] = df_users["numero_documento"].fillna("Desconocido")
default_date = pd.to_datetime("1900-01-01")
df_users["fecha_nacimiento"] = pd.to_datetime(df_users["fecha_nacimiento"], errors="coerce").fillna(default_date)
df_users.isna().sum()

id_cliente          0
nombre_completo     0
email               0
telefono            0
username            0
numero_documento    0
fecha_nacimiento    0
dtype: int64

In [ ]:
df_address.head(1)
df_address.isna().sum()
df_address=df_address.dropna(subset=["id_direccion"]).copy()
df_address=df_address.dropna(subset=["id_cliente"]).copy()
df_address=df_address.dropna(subset=["codigo_ciudad"]).copy()
df_address["descripcion"] = df_address["descripcion"].fillna("Desconocido")
df_address["ciudad"] = df_address["ciudad"].fillna("Desconocido")
df_address["pais"] = df_address["pais"].fillna("Desconocido")
df_address["codigo_postal"] = df_address["codigo_postal"].fillna("Desconocido")

,id_direccion,id_cliente,descripcion,codigo_ciudad
0,1,14.0,"Avenida de Ib치n Vi침a 13\r\nVizcaya, 54596",4106.0

In [ ]:
df_products.head(1)
df

,id_producto,producto,descripcion,categoria,unidad,precio,is_active
0,1,Et,Occaecati ad laborum suscipit nostrum itaque.,hogar,lt,"159,08",VERDADERO

In [4]:
df_sales

    id  fecha  id_cliente  direccion_id     total
0    1  45860          25            31    849,13
1    2  45427          15            17     296,7
2    3  45561          11            12    434,89
3    4  45773          18            31   -281,43
4    5  45840          10            36    475,08
5    6  45628           5            40   1867,16
6    7  45492          23            11    524,06
7    8  45228          20            38   1782,84
8    9  45278          13            33    1014,4
9   10  45344          29            12   1838,29
10  11  45913           8            39    841,43
11  12  45238           2            15    259,44
12  13  45507          25            38   1290,55
13  14  45901          28            31     254,4
14  15  45843           3            30    683,66
15  16  45571          15             3   1179,38
16  17  45616          23             5    1562,1
17  18  45843          29            25   1419,67
18  19  45882          21            15  -1077,92
19  20  45551          17            33    107,16
20  21  45804          24             4   1102,95
21  22  45738          12            37    206,16
22  23  45627          14             8    483,94
23  24  45838          27            22  2321,655
24  25  45221           8             7    1655,7
25  26  45268          19            29   1812,34
26  27  45620          28            35   1577,09
27  28  45736           4            13   1265,89
28  29  45445          29            29   1669,89
29  30  45225           3            34   1361,27
30  31  45733          27            27    833,03
31  32  45480          17            33    317,73
32  33  45217           8            23   1561,91
33  34  45722          24             7   1897,88
34  35  45439          10            13   1192,16
35  36  45697          20            14   1727,48
36  37  45567          24            35   1783,43
37  38  45827           7            31   1469,37
38  39  45524          24             5    914,49
39  40  45383          12            21   1028,64
40  41  45208           9             4   1423,94
41  42  45521          22            39    428,54
42  43  45249          16            28   1824,81
43  44  45226          30             7   1645,22
44  45  45773           3            17    773,79
45  46  45382          25             1   1374,47
46  47  45420          29            13    640,53
47  48  45604           7             1    306,92
48  49  45638           6            26   410,875
49  50  45914           8             3    381,15

In [14]:
df_salesdetails.head(1)

   id_detalle  id_venta  id_producto  cantidad subtotal
0           1        12            5         3   796,98